app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Awesome!"], ["created_at", "2015-05-06 01:42:09.654610"], ["movie_id", 1], ["stars", 5], ["updated_at", "2015-05-06 01:42:09.654610"], ["user_id", 1]]